# Pandas Concat()
Pandas provides various facilities for easily combining together series, dataFrame and panel object

In [1]:
import pandas as pd

In [2]:
sr1 = pd.Series([0,1,2])
sr1

0    0
1    1
2    2
dtype: int64

In [3]:
sr2 = pd.Series([3,4,5])
sr2

0    3
1    4
2    5
dtype: int64

In [4]:
pd.concat([sr1, sr2])

0    0
1    1
2    2
0    3
1    4
2    5
dtype: int64

In [5]:
df1 =pd.DataFrame({"ID" : [1,2,3,4],
            "Name" : ["A","B","C","D"],
            "Class" : [5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [6]:
df2 =pd.DataFrame({"ID" : [5,6,7,8],
            "Name" : ["A","B","C","D"],
            "Class" : [5,6,7,8]})
df2

   ID Name  Class
0   5    A      5
1   6    B      6
2   7    C      7
3   8    D      8

In [7]:
pd.concat([df1 , df2])

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    A      5
1   6    B      6
2   7    C      7
3   8    D      8

In [8]:
pd.concat([df1 , df2],axis = 1)

   ID Name  Class  ID Name  Class
0   1    A      5   5    A      5
1   2    B      6   6    B      6
2   3    C      7   7    C      7
3   4    D      8   8    D      8

In [9]:
df2 =pd.DataFrame({"ID" : [5,6],
            "Name" : ["A","B"],
            "Class" : [5,6]})
df2

   ID Name  Class
0   5    A      5
1   6    B      6

In [10]:
pd.concat([df1,df2])

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    A      5
1   6    B      6

In [11]:
pd.concat([df1,df2],axis=1)

   ID Name  Class   ID Name  Class
0   1    A      5  5.0    A    5.0
1   2    B      6  6.0    B    6.0
2   3    C      7  NaN  NaN    NaN
3   4    D      8  NaN  NaN    NaN

In [12]:
pd.concat([df1,df2],axis=1,join="inner")

   ID Name  Class  ID Name  Class
0   1    A      5   5    A      5
1   2    B      6   6    B      6

In [19]:
df2 =pd.DataFrame({"ID" : [5,6,7,8],
            "Name" : ["A","B","C","D"],
            "Class" : [5,6,7,8]})
df2

   ID Name  Class
0   5    A      5
1   6    B      6
2   7    C      7
3   8    D      8

In [20]:
df1 =pd.DataFrame({"ID" : [1,2,3,4],
            "Name" : ["A","B","C","D"],
            "Class" : [5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [23]:
pd.concat([df1,df2],axis=1, join_axes =[df2.index])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [22]:
pd.concat([df1,df2],keys = ['df1','df2'])

       ID Name  Class
df1 0   1    A      5
    1   2    B      6
    2   3    C      7
    3   4    D      8
df2 0   5    A      5
    1   6    B      6
    2   7    C      7
    3   8    D      8

In [24]:
pd.concat([df1,df2],keys = ['First Dataframe','Second Dataframe'])

                    ID Name  Class
First Dataframe  0   1    A      5
                 1   2    B      6
                 2   3    C      7
                 3   4    D      8
Second Dataframe 0   5    A      5
                 1   6    B      6
                 2   7    C      7
                 3   8    D      8

In [25]:
pd.concat([df1,df2,],axis=1,keys=["first DF","Second df"])

  first DF            Second df
        ID Name Class        ID Name Class
0        1    A     5         5    A     5
1        2    B     6         6    B     6
2        3    C     7         7    C     7
3        4    D     8         8    D     8